МедПреды_sql/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

МедПреды_sql/src/CommonModules/МобильноеПриложениеВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Запускается при начале работы клиента. Устанавливает ограничения по тарификации.
//
Процедура ПередНачаломРаботыКлиента(ТребуетсяОбновлениеИнтерфейса = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Если не включено разделение, то пропускаем
	Если НЕ ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.ИдентификаторПользователяИБ
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.Служебный
	|	И Пользователи.ИдентификаторПользователяИБ <> &ПустойИД
	|	И НЕ Пользователи.ПометкаУдаления";
	Запрос.УстановитьПараметр("ПустойИД", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	ТаблицаРезультатаЗапроса = Запрос.Выполнить().Выгрузить();
	
	МассивПользователей = ТаблицаРезультатаЗапроса.ВыгрузитьКолонку("ИдентификаторПользователяИБ");
	
	Если ЭтоМобильноеПриложение() Тогда
		УстановитьЭтоМобильноеПриложение(Ложь);
		// Снимаем ограничения
		УстановитьОбычныйИнтерфейс(МассивПользователей);
		Для каждого ТекПользователь Из МассивПользователей Цикл
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекПользователь);
			Если ПользовательИБ = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			МедПредыСервер.УстановитьСоставФорм(ТребуетсяОбновлениеИнтерфейса, ПользовательИБ.Имя);
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ НадоОбновлятьКеш()
		ИЛИ НЕ ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
			
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Возвращает признак того, что эта информационная база работает в режиме ограниченной функциональности.
//
Функция ЭтоМобильноеПриложение() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ЭтоМобильноеПриложение.Получить();
	
КонецФункции

// Возвращает признак того, что эта информационная база работает в режиме ограниченной функциональности.
//
Функция НужноОграничитьФункциональность() Экспорт
	
	Возврат ЭтоМобильноеПриложение();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КодТарифаМобильногоУНФ()
	
	Возврат "sbm_mobile";
	
КонецФункции

Функция ИспользуетсяСервисТарификации()
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ИспользоватьВнутреннийСервисТарификации.Получить();
	
КонецФункции

Функция ВремяЖизниКешаПоТарификацииВМинутах()
	
	Возврат 5;
	
КонецФункции

Функция НадоОбновлятьКеш()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаКеша = Константы.ДатаОбновленияКешаТарификации.Получить();
	Если Не ЗначениеЗаполнено(ДатаКеша) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат (ТекущаяДатаСеанса() - ДатаКеша)/60 > ВремяЖизниКешаПоТарификацииВМинутах();
	
КонецФункции

Функция ТекстОшибкиПодключения()
	
	Возврат(НСтр("ru = 'Не возможно подключиться к Менеджеру сервиса.'"));
	
КонецФункции

Функция ЕстьАктивныйТарифМобильногоУНФ(Знач ОтветСтрокой)
	
	Если ПустаяСтрока(ОтветСтрокой) Тогда
		ВызватьИсключение(НСтр("ru = 'Пустой ответ Менеджера сервиса по тарифам.'"));
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ОтветСтрокой);
	Данные = ПрочитатьJSON(ЧтениеJSON, Ложь);
	ЧтениеJSON.Закрыть();
	
	АктивныеТарифы = Неопределено;
	Данные.Свойство("TariffList", АктивныеТарифы);
	Если ТипЗнч(АктивныеТарифы) <> Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого ТекущийТариф Из АктивныеТарифы Цикл
		Если ТипЗнч(ТекущийТариф) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		
		ИдентификаторТарифа = Неопределено;
		ТекущийТариф.Свойство("ID", ИдентификаторТарифа);
		Если ТипЗнч(ИдентификаторТарифа) = Тип("Строка") 
			И ИдентификаторТарифа = КодТарифаМобильногоУНФ() Тогда
				Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция УстановитьЭтоМобильноеПриложение(Знач Значение)
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.ЭтоМобильноеПриложение.Установить(Значение);
	Константы.ЭтоОбычноеПриложение.Установить(НЕ Значение);
	
КонецФункции

Процедура УстановитьОбычныйИнтерфейс(МассивПользователей)
	
	Для каждого ТекПользователь Из МассивПользователей Цикл
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекПользователь);
		Если ПользовательИБ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", Неопределено,, ПользовательИБ.Имя);
	КонецЦикла;
	
КонецПроцедуры 

Процедура УстановитьМинимальныйИнтерфейс(МассивПользователей)

	Настройки = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	НастройкиСостава = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	НастройкиСостава.Лево.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельИнструментов"));
	Настройки.УстановитьСостав(НастройкиСостава);
	
	Для каждого ТекПользователь Из МассивПользователей Цикл
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекПользователь);
		Если ПользовательИБ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", Настройки,, ПользовательИБ.Имя);
	КонецЦикла;

КонецПроцедуры

Процедура СервисныеОперацииМобильногоПриложения() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МобильноеПриложение.Ссылка,
	|	МобильноеПриложение.ДатаПоследнейСинхронизации
	|ИЗ
	|	ПланОбмена.МобильноеПриложение КАК МобильноеПриложение
	|ГДЕ
	|	МобильноеПриложение.ДатаПоследнейСинхронизации <= &ДатаПоследнейСинхронизации";
	
	Запрос.УстановитьПараметр("ДатаПоследнейСинхронизации", ТекущаяДатаСеанса() - 86400);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ДатаПоследнейСинхронизации) Тогда
			ОбменМобильноеПриложениеОбщее.ОчиститьОчередьСообщенийОбменаСМобильнымКлиентом(Выборка.Ссылка);
		Иначе
			УстановитьПривилегированныйРежим(Истина);
			Попытка
				Узел = Выборка.Ссылка.ПолучитьОбъект();
				Узел.ДатаПоследнейСинхронизации = ТекущаяДатаСеанса();
				Узел.Записать();
			Исключение
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Мобильное приложение.Установка даты последней синхронизации в регламентном задании'"),
					УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			КонецПопытки;
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
